Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If an invalid character is encountered, a warning will be issued and the invalid character and all subsequent characters (valid or invalid) within the braces will be discarded.
es_es: Si se encuentra un carácter inválido, se emitirá una advertencia y el carácter inválido y todos los demás caracteres (válidos o no) dentro de las llaves serán descartados.

source: Once you hit EOF on your read and then sleep for a while, you (probably) have to stick in a dummy seek() to reset things.
es_es: Una vez que llegue al EOF en lectura y si se echa a dormir por un tiempo, (probablemente) tendrá que tocarlo con un ficticio seek() para restablecer las cosas.

source: by Tom Christiansen and Nathan Torkington,
es_es: Tom Christiansen y Nathan Torkington,

source: This should resolve problems with initializing and destroying the Perl interpreter more than once in a single process.
es_es: Esto debería resolver los problemas con la inicialización y destrucción del intérprete de Perl presente más de una vez en un único proceso.

source: You can also get the precision from the next argument using C<.*>:
es_es: También puede obtener la precisión del siguiente argumento usando C<.*>:

source: perlobj Perl objects
es_es: perlobj Objetos

source: If TEMPLATE requires fewer arguments than given, extra arguments are ignored.
es_es: Si PLANTILLA requiere menos argumentos de los que se le dan, los argumentos adicionales son ignorados.

source: $iaddr = inet_aton("127.1"); # or whatever address
es_es: $iaddr = inet_aton("127.1"); # o la dirección que sea

source: In the child process, the filehandle isn't opened--I/O happens from/to the new STDOUT/STDIN.
es_es: En el proceso hijo, el identificador de archivo no se abre: la E/S sucede desde/hasta el nuevo STDOUT/STDIN.

source: $program =~ s {
es_es: $programa =~ s {

source: If C<use locale> is in effect, the case map used by C<\l>, C<\L>, C<\u>, and C<\U> is taken from the current locale.
es_es: Si C<use locale> está en vigor, el mapeo de tamaños de caja usado por C<\l>, C<\L>, C<\u> y C<\U> es tomado de la localización actual.

source: In addition, Perl defines the following: X<\g> X<\k> X<\K> X<backreference>
es_es: Ademas, Perl define lo siguiente: X<\g> X<\k> X<\K> X<backreference>

source: A special form is the C<(DEFINE)> predicate, which never executes its yes-pattern directly, and does not allow a no-pattern.
es_es: Una forma especial es el predicado C<(DEFINE)>, que nunca ejecuta directamente su patrón-sí, y no permite un patrón-no.

source: # record flocking enforcement, a platform-dependent feature.
es_es: # bloqueo forzado de registro, una característica dependiente de la plataforma.

source: Bytes are irrelevant here, and so are encodings.
es_es: En este contexto, los bytes y las codificaciones son irrelevantes.

source: The byteorder on the platform where Perl was built is also available via L<Config>:
es_es: El orden de los bytes en la plataforma donde Perl fue compilado está también disponible vía L<Config>:

source: $now_string = localtime; # e.g., "Thu Oct 13 04:54:34 1994"
es_es: $ahora = gmtime; # ej., "Thu Oct 13 04:54:34 1994"

source: by Tom Christiansen and Nathan Torkington
es_es: Tom Christiansen y Nathan Torkington

source: If LENGTH is negative, removes the elements from OFFSET onward except for -LENGTH elements at the end of the array.
es_es: Si LONGIIUD es negativa, elimina los elementos desde DESPLAZAMIENTO hacia adelante, excepto -LONGITUD elementos al final del array.

source: =item defined EXPR X<defined> X<undef> X<undefined>
es_es: =item defined EXPR X<defined> X<undef> X<undefined> X<definido> X<indefinido>

source: =item require VERSION X<require>
es_es: =item require VERSIÓN X<require>

source: B<piconv> is a Perl version of B<iconv>, a character encoding converter widely available for various Unixen today.
es_es: B<piconv> es una versión Perl de B<iconv>, un conversor de codificaciones de caracteres de uso muy extendido en el mundo Unix.

source: =head2 Binding Operators X<binding> X<operator, binding> X<=~> X<!~>
es_es: =head2 Operadores de vinculación X<binding> X<operator, binding> X<=~> X<!~> X<vinculación>

source: =head2 Removed "Attempt to clear a restricted hash"
es_es: =head2 Eliminado "I<Attempt to clear a restricted hash>" (Intento de limpiar un hash restringido)

source: next LINE if /^#/;
es_es: next LINEA if /^#/;

source: use C<CE<lt>E<gt>> for function, variable and module names (and more generally anything that can be considered part of code, like filehandles or specific values).
es_es: use C<CE<lt>E<gt>> por función, variable y nombres de módulos (y más generalmente cualquier cosa que pueda ser considerada parte del código, como identificadores de archivo o valores específicos).

source: =item push ARRAY,LIST X<push> X<stack>
es_es: =item push ARRAY,LISTA X<push> X<stack> X<pila>

source: You may want to remove it from your link line.
es_es: Si lo desea puede eliminarlo de su línea de enlazado.

source: In other words, list operators tend to gobble up all arguments that follow, and then act like a simple TERM with regard to the preceding expression.
es_es: En otras palabras, los operadores de lista tienden a devorar todos los argumentos que le siguen, y luego actuar como un simple TÉRMINO con respecto a la expresión precedente.

source: If there are any key/value pairs, it returns true; more precisely, the value returned is a string consisting of the number of used buckets and the number of allocated buckets, separated by a slash.
es_es: Si tiene algún par clave/valor, devuelve verdadero; más exactamente, el valor devuelto es una cadena que consiste en el número de cajones utilizados y el número de cajones reservados, separados por una barra.

source: Specifying a negative flag after the caret is an error, as the flag is redundant.
es_es: Especificar una bandera negativa después del circunflejo es un error, ya que la bandera es redundante.

source: In addition to bug fixes, C<format>'s features have been enhanced.
es_es: Además de las correcciones de errores, las características de C<format> han sido mejoradas.

source: The identifier C<_> is now forced to be a bareword after a filetest operator.
es_es: Se fuerza a que el identificador C<_> sea considerada una palabra suelta después de un operador de test de fichero.

source: Not supported.
es_es: No soportado.

source: Another consequence of using binmode() (on some systems) is that special end-of-file markers will be seen as part of the data stream.
es_es: Otra consecuencia de usar binmode() (en algunos sistemas) es que las marcas especiales de fin-de-archivo serán vistas como parte del flujo de datos.

source: $is_his = (stat($filename)->uid == pwent($whoever)->uid);
es_es: $is_his = (stat($archivo)->uid == pwent($loquesea)->uid);

source: (You are not allowed to C<open> to a command that pipes both in I<and> out, but see L<IPC::Open2>, L<IPC::Open3>, and L<perlipc/"Bidirectional Communication with Another Process"> for alternatives.)
es_es: (No se le permite hacer un C<open> a un comando que entube tanto en la entrada I<como> en la salida, pero vea L<IPC::Open2>, L<IPC::Open3>, y L<perlipc/"Comunicación bidireccional con otro proceso"> para alternativas sobre esto).

source: In 5.8.0 this
es_es: En 5.8.0, esto

source: Just like special scalars and arrays, there are also special hashes.
es_es: De la misma manera que hay escalares y arrays especiales, también hay hashes especiales.

source: So avoid C<$&>, C<$'>, and C<$`> if you can, but if you can't (and some algorithms really appreciate them), once you've used them once, use them at will, because you've already paid the price.
es_es: Así que evite C<$&>, C<$'>, y C<$`> si puede, pero si no puede (y algunos algoritmos realmente los necesitan), una vez que los use aunque sea una sola vez, úselos a voluntad, ya que ya habrá pagado el precio.

source: See L<perlop/"Quote and Quote-like Operators">.
es_es: Ver L<perlop/"Comillas y Operadores de comillas">.

source: If what's within the angle brackets is neither a filehandle nor a simple scalar variable containing a filehandle name, typeglob, or typeglob reference, it is interpreted as a filename pattern to be globbed, and either a list of filenames or the next filename in the list is returned, depending on context.
es_es: Si lo que está dentro de los ángulos no es ni un identificador de archivo ni una variable escalar simple que contenga un nombre de identificador de archivo, I<typeglob>, o referencia a I<typeglob>, se interpreta como un patrón de nombre de archivo para ser expandido, y será devuelta la lista de nombres de archivo o el siguiente nombre de archivo de la lista, dependiendo del contexto.

source: However, if you're using lexically-scoped private variables created with C<my()>, you'll have to make sure your format or subroutine definition is within the same block scope as the my if you expect to be able to access those private variables.
es_es: Sin embargo, si está usando variables privadas en un contexto local creadas con C<my()>, deberá asegurarse que su definición de formato o subrutina están dentro del mismo bloque que el C<my> si quiere acceder a estas variables privadas.

source: Finally, because Perl is frequently (but not always, and certainly not by definition) an interpreted language, you can write your programs and test them without an intermediate compilation step, allowing you to experiment and test/debug quickly and easily.
es_es: Por último, como Perl es frecuentemente un lenguaje interpretado (aunque no siempre y, desde luego, no por definición), puede escribir sus programas y probarlos sin un paso de compilación intermedia, lo que le permite experimentar y probar/depurar de manera rápida y sencilla.

source: It's tempting to add extra features until your code is a monolithic system rather than a set of modular building blocks.
es_es: Es tentador añadir características adicionales hasta que su código sea un sistema monolítico en lugar de un conjunto de bloques de construcción modulares.

source: You must also do this when interpolating a variable into a string to separate the variable name from a following double-colon or an apostrophe, since these would be otherwise treated as a package separator: X<interpolation>
es_es: También debe hacer esto cuando la interpolación de una variable en una cadena para separar el nombre de una variable del carácter dos puntos o un apóstrofo, ya que de otro modo serían tratados como un separador de paquete: X<interpolation> X<interpolación>

source: eval '$answer = $a / $b'; warn $@ if $@;
es_es: eval '$respuesta = $a / $b'; warn $@ if $@;

source: Interprets EXPR as a hex string and returns the corresponding value.
es_es: Interpreta EXPR como una cadena en hexadecimal y devuelve el valor correspondiente.

source: I said foo.
es_es: He dicho foo.

source: Bits of a byte are numbered in a little-endian-ish way, as in C<0x01>, C<0x02>, C<0x04>, C<0x08>, C<0x10>, C<0x20>, C<0x40>, C<0x80>.
es_es: Los bits de un byte se numeran de la forma little-endian, como en C<0x01>, C<0x02>, C<0x04>, C<0x08>, C<;0x10>, C<0x20>, C<0x40>; C<0x80>.

source: @dots = grep { /^\./ && -f "$some_dir/$_" } readdir($dh);
es_es: @dots = grep { /^\./ && -f "$algun_dir/$_" } readdir($dh);

source: C<perl.exe> on Windows now has a "Camel" logo icon.
es_es: C<perl.exe> en Windows ahora tiene un icono de un "Camello".

source: B<WARNING>: Difficult material (and prose) ahead.
es_es: B<ADVERTENCIA>: sigue material (y prosa) difícil.

source: Some have been part of the core language for many years.
es_es: Algunos han sido parte del núcleo del lenguaje durante muchos años.

source: If protected by C<\>, C<$> will be quoted to became C<"\\\$">; if not, it is interpreted as the start of an interpolated scalar.
es_es: Si está protegido por un C<\>, C<$> será escapado para convertirse en C<"\\\$">; si no, es interpretado como el inicio de un escalar interpolado.

source: Unicode semantics are used for the case change.
es_es: Semántica Unicode es utilizada para el cambio de tamaño de caja.

source: Your bug report, along with the output of C<perl -V>, will be sent off to perlbug@perl.org to be analysed by the Perl porting team.
es_es: Su informe de error, junto con la salida de C<perl -V>, serán enviados a perlbug@perl.org para ser analizado por el equipo de adaptación de Perl.

source: See select(2) and fcntl(2) for further details.
es_es: Vea select(2) y fcntl(2) para más detalles.

source: Just don't forget that you have to put a semicolon on the end to finish the statement, as Perl doesn't know you're not going to try to do this:
es_es: Pero no olvide que tiene que poner un punto y coma al final para terminar la instrucción, ya que Perl no sabe que no vamos a tratar de hacer esto:

source: =item C<(?(condition)yes-pattern|no-pattern)> X<(?()>
es_es: =item C<(?(condición)patrón-sí|patrón-no)> X<(?()>

source: =item I<Learning Perl> (the "Llama Book")
es_es: =item I<Learning Perl> (el "Libro de la Llama")

source: See the Carp module for other kinds of warnings using its carp() and cluck() functions.
es_es: Vea el módulo Carp para otros tipos de avisos mediante sus funciones carp() y cluck().

source: # Round number to 3 digits after decimal point
es_es: # Redondea número a 3 dígitos después del punto decimal

source: This program will print only the line containing "Bar".
es_es: Este programa imprimirá sólo la línea que contiene "Bar".

source: Support for the POSIX C<clock_gettime()> and C<clock_getres()> has been added
es_es: Se ha añadido soporte para las funciones POSIX C<clock_gettime()> y C<clock_getres()>

source: For Perls 5.8.0 and later, PerlIO is (most often) the default.
es_es: Para las versiones de Perl 5.8.0 y posteriores, PerlIO es (casi siempre) el valor predeterminado.

source: /$unquoted\Q$quoted\E$unquoted/
es_es: /$noescapados\Q$escapados\E$noescapados/

source: C<Module::CoreList> no longer contains the C<%:patchlevel> hash.
es_es: C<Module::CoreList> ya no contiene el hash C<%:patchlevel>.

source: # U0-mode, so the UTF-8 bytes get joined into characters
es_es: # un modo U0, así que los bytes UTF-8 se han unidos en caracteres

source: perlapi Perl API listing (autogenerated)
es_es: perlapi Lista de API

source: =head2 Growing Your Own
es_es: =head2 Creciendo

source: If C<stat> is passed the special filehandle consisting of an underline, no stat is done, but the current contents of the stat structure from the last C<stat>, C<lstat>, or filetest are returned.
es_es: Si a C<stat> se le pasa el identificador de archivo especial consistente en un subrayado, no se hacen estadísticas, sino que se devuelven el contenido actual de la estructura de estadísticas de la última llamada C<stat>, C<lstat>, o test de archivos.

source: # (warning: assumes no { or } in strings)
es_es: # (aviso: asumes que no hay { o } en cadenas)

source: Regexp objects (those created with C<qr>) now have S-magic rather than R-magic.
es_es: Objetos Regexp (los creados con C<qr>) ahora tienen S-magic en lugar de R-magic.

source: This tutorial speaks in rather absolute terms, and provides only a limited view of the wealth of character string related features that Perl has to offer.
es_es: En este tutorial hablamos en términos absolutos, y solo proporcionamos una visión limitada de las muchas características relacionadas con el procesamiento de cadenas de caracteres que Perl ofrece.

source: It provides a checklist against which modules can be compared to determine whether they conform to best practice, without necessarily describing in detail how to achieve this.
es_es: Proporciona una lista de control contra el que los módulos se pueden comparar para determinar si se ajustan a las mejores prácticas, sin que necesariamente se describe en detalle cómo lograrlo.

source: It is at this stage that C<split()> silently optimizes C</^/> to mean C</^/m>.
es_es: Es en esta etapa en que C<split()>, silenciosamente, optimiza C</^/> para que signifique C</^/m>.

source: @fields = split /(A)|B/, "1A2B3";
es_es: @campos = split /(A)|B/, "1A2B3";

source: (This is implemented using C's pow(3) function, which actually works on doubles internally.)
es_es: (Esto se realiza mediante la función del C pow(3), que en realidad trabaja internamente con dobles).

source: (This trick is used by Pugs.)
es_es: (Este truco es usado por Pugs.)

source: How that string gets evaluated is entirely subject to the command interpreter on your system.
es_es: El cómo esta cadena es evaluada, está sujeta enteramente al intérprete de comandos de su sistema.

source: Most modern systems always sleep the full amount.
es_es: La mayoría de los sistemas modernos siempre duermen la cantidad correspondiente.

source: This section hopes to clarify how Perl handles quoted constructs.
es_es: Esta sección pretende aclarar la manera en que Perl maneja las construcciones entrecomilladas.

source: Once you've unpacked the distribution, run Configure (see INSTALL for full discussion of the Configure options), and then run make, then "make test" then "make install" (this last step may require UID=0 privileges).
es_es: Una vez que haya descomprimido la distribución, ejecute B<Configure> (consulte INSTALL para una descripción completa de las opciones de configuración), y luego ejecutar B<make>, y luego "make test" y luego "make install" (este último paso puede requerir privilegios UID=0).

source: Calls the System V IPC function shmget.
es_es: Llama a la función System V IPC shmget(2).

source: Note that, because C<eval> traps otherwise-fatal errors, it is useful for determining whether a particular feature (such as C<socket> or C<symlink>) is implemented.
es_es: Note que, como C<eval> atrapa errores considerados fatales, es útil para determinar cuando una característica en particular (como C<socket> o C<symlink>) está implementada.

source: /\* # Match the opening delimiter.
es_es: /\* # Busca el delimitador de apertura.

source: C<Switch> is buggy and should be avoided.
es_es: C<Switch> es defectuoso y debe ser evitado.

source: use the modified Package only within your corporation or organization.
es_es: utilice el Paquete modificado sólo dentro de su empresa u organización.

source: =head2 HP-UX: HP cc warnings about sendfile and sendpath
es_es: =head2 HP-UX: advertencias de HP cc sobre sendfile y sendpath

source: There has been a fair amount of refactoring of the C<C> source code, partly to make it tidier and more maintainable.
es_es: Se ha hecho una buena cantidad de refactorizaciones del código fuente C<C>, en parte para que sea más ordenado y más fácil de mantener.

source: # This loop reads from STDIN, and prints non-blank lines:
es_es: # Este bucle lee de STDIN e imprime las líneas que no estén vacías:

source: So anything that looks like \\, \(, \), \<, \>, \{, or \} is always interpreted as a literal character, not a metacharacter.
es_es: Así que cualquier cosa que se parezca a \\, \(, \), \<, \>, \{, or \} es siempre interpretado como un carácter literal, no un metacarácter.

source: =item Keywords related to Perl modules X<module>
es_es: =item Palabras clave relativas a los módulos Perl X<module> X<módulo>

source: binmode() is important not only for readline() and print() operations, but also when using read(), seek(), sysread(), syswrite() and tell() (see L<perlport> for more details).
es_es: binmode() no sólo es importante para las operaciones readline() y print(), sino también cuando se usan read(), seek(), sysread(), syswrite() y tell() (ver L<perlport> para más detalles).

source: for $count (10,9,8,7,6,5,4,3,2,1,'BOOM') {
es_es: for $cuenta_atras (10,9,8,7,6,5,4,3,2,1,'BOOM') {

source: wrong
es_es: mal

source: Signal dispatch has been moved from the runloop into control ops.
es_es: El despacho de señales ha sido movido del bucle de ejecución a los operadores de control.

source: MAD, which stands for I<Misc Attribute Decoration>, is a still-in-development work leading to a Perl 5 to Perl 6 converter.
es_es: MAD, que significa I<Misc Attribute Decoration>, es un trabajo todavía en desarrollo que conduce a un convertidor de Perl 5 a Perl 6.

source: This feature was implemented by the indefatigable Nicholas Clark, based on an idea by Mike Giroux.
es_es: Esta característica se implementó por el infatigable Nicholas Clark, basado en una idea de Mike Giroux.

source: 0x78 0x56 0x34 0x12 # little-endian
es_es: 0x78 0x56 0x34 0x12 # little-endian (byte inferior antes

source: $group_read = ($mode & S_IRGRP) >> 3;
es_es: $grupo_lectura = ($modo & S_IRGRP) >> 3;

source: } while $cheering;
es_es: } while $sonrias;

source: open(FOO, "-|", "cat", "-n", $file);
es_es: open(FOO, "-|", "cat", "-n", $archivo);

source: Line up your transliterations when it makes sense:
es_es: Alinear transliteraciones cuando tengan sentido:

source: =item state TYPE EXPR : ATTRS
es_es: =item state TIPO EXPR : ATRIBS

source: Thus the content is interpolated as though it were double quoted and then executed via the shell, with the results of the execution returned.
es_es: Así, el contenido es interpolado como si estuviera entrecomillado doble y luego ejecutado a través del shell, devolviendo los resultados de la ejecución.

source: A source code patch against the Perl 5.8.1 sources will be available in CPAN as F<authors/id/H/HM/HMBRAND/dor-5.8.1.diff>.
es_es: Un parche para las feuntes del código Perl 5.8.1 estará disponibles en CPAN como F<authors/id/H/HM/HMBRAND/dor-5.8.1.diff>.

source: C<h2xs> implements new option C<--use-xsloader> to force use of C<XSLoader> even in backwards compatible modules.
es_es: C<h2xs> implementa una nueva opción: C<--use-xsloader>, para forzar el uso de C<XSLoader> incluso en módulos retro-compatibles.

source: Because BLOCKs are always bounded by curly brackets, there is never any ambiguity about which C<if> an C<else> goes with.
es_es: Como los BLOQUES están siempre rodeados de llaves, nunca hay ambigüedad sobre dónde van el C<if> y el C<else>.

source: my $path = shift;
es_es: my $ruta = shift;

source: B<WARNING>: Particularly complicated regular expressions can take exponential time to solve because of the immense number of possible ways they can use backtracking to try for a match.
es_es: B<ADVERTENCIA>: Especialmente complicadas expresiones regulares pueden tomar un tiempo exponencial en resolverse debido a la inmensa cantidad de formas posibles que puede utilizar para tratar de dar marcha atrás para lograr una coincidencia.

source: See L<feature> and L<perlsyn/"Switch statements">.
es_es: Vea L<feature> y L<perlsyn/"Instrucciones Switch">.)

source: open(OLDERR, ">&", \*STDERR) or die "Can't dup STDERR: $!";
es_es: open(OLDERR, ">&", \*STDERR) or die "No puedo duplicar STDERR: $!";

source: @alphabet = ("A" ..
es_es: @alfabeto = ("A" ..

source: For the inverse cosine operation, you may use the C<Math::Trig::acos()> function, or use this relation:
es_es: Para la inversa de la operación coseno, puede usar la función C<Math::Trig::acos()>, o usar esta relación:

source: 3.14_15_92 # a very important number
es_es: 3.14_15_92 # un número muy importante

source: C</x> tells the regular expression parser to ignore most whitespace that is neither backslashed nor within a character class.
es_es: C</x> indica al analizador de expresiones regulares que ignore la mayoría de los espacios en blanco que no estén escapados con barras invertidas o que no estén dentro de una clase de caracteres.

source: 6: got ABC
es_es: 6: tenemos ABC

source: =item Packaging Tools
es_es: =item Herramientas de empaquetado

source: Returns the shared memory segment id, or C<undef> on error.
es_es: Devuelve el id del segmento de memoria compartida, o C<undef> en caso de error.
